In [1]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine
import getpass  # To get the password without showing the input
password = getpass.getpass()

 ········

In [2]:
bd = "sakila"
connection_string = 'mysql+pymysql://root:' + password + '@127.0.0.1/'+bd
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@127.0.0.1/sakila)

In [13]:
from sqlalchemy import text
import calendar

In [23]:
#test
def sakila_rentals(engine, month, year):
    with engine.connect() as connection:
        txt = f"""
        SELECT DATE_FORMAT(CONVERT(rental_date, DATE), '%m') AS month, 
               DATE_FORMAT(CONVERT(rental_date, DATE), '%Y') AS year, 
               COUNT(rental_id) AS rental_count 
        FROM sakila.rental 
        GROUP BY month, year"""
        query = text(txt)
        result = connection.execute(query)
        return pd.DataFrame(result.fetchall())

In [24]:
sakila_rentals(engine, 5, 2005)

  month  year  rental_count
0    05  2005          1156
1    06  2005          2311
2    07  2005          6709
3    08  2005          5686
4    02  2006           182

In [4]:
def rentals_month(engine, month, year):
    with engine.connect() as connection:
        txt = f"""
        SELECT DATE_FORMAT(CONVERT(rental_date, DATE), '%m') AS month, 
               DATE_FORMAT(CONVERT(rental_date, DATE), '%Y') AS year, 
               COUNT(rental_id) AS rental_count 
        FROM sakila.rental 
        WHERE YEAR(rental_date) = {year} AND MONTH(rental_date) = '{month}'
        GROUP BY month, year
        ORDER BY month, year;
        """
        query = text(txt)
        result = connection.execute(query)
        return pd.DataFrame(result.fetchall())

In [5]:
may_df = rentals_month(engine, 5, 2005)
may_df

  month  year  rental_count
0    05  2005          1156

In [14]:
def rental_count_month(engine, month, year):
    with engine.connect() as connection:
        column_name = f"rentals_{month:02d}_{year}"

        start_date = f"{year}-{month:02d}-01"
        last_day = calendar.monthrange(year, month)[1]
        end_date = f"{year}-{month:02d}-{last_day}"

        txt = f"""
            SELECT customer_id, COUNT(*) AS {column_name}
            FROM rental
            WHERE rental_date >= '{start_date}' AND rental_date < '{end_date} 23:59:59'
            GROUP BY customer_id;
        """
        query = text(txt)

        result = connection.execute(query)
        df = pd.DataFrame(result.fetchall(), columns=['customer_id', column_name])

    return df

In [16]:
may_df_count = rental_count_month(engine, 5, 2005)
may_df_count

     customer_id  rentals_05_2005
0            130                2
1            459                1
2            408                3
3            333                1
4            222                5
..           ...              ...
515          191                2
516          351                1
517           10                1
518          136                1
519           61                1

[520 rows x 2 columns]

In [25]:
august_df = rentals_month(engine, 8, 2005)
august_df

  month  year  rental_count
0    08  2005          5686

In [26]:
august_df_count = rental_count_month(engine, 8, 2005)
august_df_count

     customer_id  rentals_08_2005
0            113               10
1            578                7
2            377               10
3             77               11
4             64                8
..           ...              ...
594          537                7
595          524                6
596          281                2
597          205                6
598          318                1

[599 rows x 2 columns]

In [27]:
def compare_rentals(df1, df2, column_name1, column_name2):
    df_combined = df1.merge(df2, on='customer_id', how='outer').fillna(0)
    df_combined['difference'] = df_combined[column_name1] - df_combined[column_name2]
    return df_combined

In [28]:
compare_rentals(may_df_count, august_df_count, 'rentals_05_2005', 'rentals_08_2005')

     customer_id  rentals_05_2005  rentals_08_2005  difference
0            130              2.0                8        -6.0
1            459              1.0               12       -11.0
2            408              3.0               12        -9.0
3            333              1.0                9        -8.0
4            222              5.0                3         2.0
..           ...              ...              ...         ...
594          478              0.0                6        -6.0
595          255              0.0                7        -7.0
596           31              0.0                4        -4.0
597          226              0.0               10       -10.0
598          205              0.0                6        -6.0

[599 rows x 4 columns]